Hello! Testing with `v1.0.2-beta`.

Steps:

1. Start form scratch. I use megaport provider v1.0.2-beta (updated using command `terraform init -upgrade`)
2. terraform apply
3. verify in Staging environment that everything is deployed. Note down vlan ID's of Port VXC (B End)
4. change value for var var.cost_centre to trigger changes
5. during terraform plan I still see a lot of unwanted changes in resources (please see example below). The expected behavior is that changed will be only to value of `cost_centre` variable. At this moment I really don't understand what will happen with my infra.
6. Terraform apply went successfully ->  in Staging Portal and verified Port VXC B End VLAN id = it was the same (not changed). So vlan id issue is now fixed. But I am not sure there are no other issues, and something important did not changed. 

Terraform plan output:
```hcl
Terraform will perform the following actions:

  # megaport_mve.fortigate will be updated in-place
  ~ resource "megaport_mve" "fortigate" {
      ~ contract_start_date    = "Monday, 15-Jul-24 11:25:58 EEST" -> (known after apply)
      ~ cost_centre            = "A-123-2024-GER-123-123" -> "A-123-2024-GER-123-124"
      ~ last_updated           = "Monday, 15-Jul-24 11:25:26 EEST" -> (known after apply)
      ~ live_date              = "Monday, 15-Jul-24 11:25:58 EEST" -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      ~ resources              = {
          + interface       = (known after apply)
          ~ virtual_machine = [
              - {
                  - cpu_count     = 4 -> null
                  - id            = 0 -> null
                  - image         = {
                      - id      = 58 -> null
                      - product = "FortiGate-VM" -> null
                      - vendor  = "Fortinet" -> null
                      - version = "7.4.3" -> null
                    } -> null
                  - resource_type = "virtual_machine" -> null
                  - up            = true -> null
                  - vnics         = [
                      - {
                          - description = "mgmt" -> null
                          - vlan        = 1305 -> null
                        },
                      - {
                          - description = "to_ipxgrx" -> null
                          - vlan        = 2674 -> null
                        },
                      - {
                          - description = "to_aws" -> null
                          - vlan        = 815 -> null
                        },
                    ] -> null
                },
            ] -> (known after apply)
        } -> (known after apply)
        # (27 unchanged attributes hidden)
    }

  # megaport_port.ipxgrx will be updated in-place
  ~ resource "megaport_port" "ipxgrx" {
      ~ attribute_tags         = {
          ~ terminated_service_details = {
              ~ device    = "" -> (known after apply)
              ~ interface = {
                  ~ demarcation   = "" -> (known after apply)
                  ~ loa_template  = "" -> (known after apply)
                  ~ media         = "" -> (known after apply)
                  ~ port_speed    = 0 -> (known after apply)
                  ~ resource_name = "" -> (known after apply)
                  ~ resource_type = "" -> (known after apply)
                  ~ shutdown      = false -> (known after apply)
                  ~ up            = 0 -> (known after apply)
                } -> (known after apply)
              ~ location  = {
                  ~ id        = 0 -> (known after apply)
                  ~ name      = "" -> (known after apply)
                  ~ site_code = "" -> (known after apply)
                } -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      ~ cancelable             = true -> (known after apply)
      ~ contract_end_date      = "Monday, 14-Jul-25 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date    = "Monday, 15-Jul-24 11:25:58 EEST" -> (known after apply)
      ~ cost_centre            = "A-123-2024-GER-123-123" -> "A-123-2024-GER-123-124"
      ~ create_date            = "Monday, 15-Jul-24 11:24:54 EEST" -> (known after apply)
      ~ last_updated           = "Monday, 15-Jul-24 11:25:26 EEST" -> (known after apply)
      ~ live_date              = "Monday, 15-Jul-24 11:25:58 EEST" -> (known after apply)
      ~ locked                 = false -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      ~ resources              = {
          ~ interface = {
              ~ demarcation   = <<-EOT
                    Equinix PA2/3
                    114 Rue Ambroise Croizat, Saint Denis
                    0210
                    Type: Single-mode Fibre Pair
                    Ports: PP:0210:1177142, ports 11+12
                    Termination: SC connector
                EOT -> (known after apply)
              ~ description   = "" -> (known after apply)
              ~ id            = 0 -> (known after apply)
              ~ loa_template  = "megaport" -> (known after apply)
              ~ media         = "LR" -> (known after apply)
              ~ name          = "" -> (known after apply)
              ~ port_speed    = 10000 -> (known after apply)
              ~ resource_name = "interface" -> (known after apply)
              ~ resource_type = "interface" -> (known after apply)
              ~ up            = 1 -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      + terminate_date         = (known after apply)
      ~ usage_algorithm        = "NOT_POST_PAID" -> (known after apply)
      ~ virtual                = false -> (known after apply)
      ~ vxc_auto_approval      = false -> (known after apply)
      ~ vxc_permitted          = true -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # megaport_vxc.aws[0] will be updated in-place
  ~ resource "megaport_vxc" "aws" {
      ~ a_end                = {
          ~ current_product_uid   = "b2e1d8d9-90d1-4c4e-b363-7d783718df6f" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ admin_locked         = false -> (known after apply)
      ~ attribute_tags       = {} -> (known after apply)
      ~ b_end                = {
          ~ current_product_uid   = "09e400a0-1b72-49ec-8ff0-5a71a4fc7774" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Interxion PAR5" -> (known after apply)
          ~ location_id           = 527 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "605cb850-dfb4-4a05-a171-8bf17757b3a2" -> (known after apply)
          ~ product_name          = "EU (Paris) (eu-west-3)" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
          ~ vnic_index            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ b_end_partner_config = {
          + partner_a_end_config = (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ cancelable           = true -> (known after apply)
      ~ company_name         = "1NCE GmbH" -> (known after apply)
      ~ contract_end_date    = "Wednesday, 14-Aug-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Monday, 15-Jul-24 11:26:38 EEST" -> (known after apply)
      ~ cost_centre          = "A-123-2024-GER-123-123" -> "A-123-2024-GER-123-124"
      ~ create_date          = "Monday, 15-Jul-24 11:25:32 EEST" -> (known after apply)
      ~ csp_connections      = [
          - {
              - bandwidth     = 100 -> null
              - bandwidths    = [
                  - 100,
                ] -> null
              - connect_type  = "AWSHC" -> null
              - connection_id = "" -> null
              - name          = "TEST-EU-Paris-ICSS-AWS" -> null
              - owner_account = "893677514652" -> null
              - resource_name = "b_csp_connection" -> null
              - resource_type = "csp_connection" -> null
            },
        ] -> (known after apply)
      ~ distance_band        = "METRO" -> (known after apply)
      ~ last_updated         = "Monday, 15-Jul-24 11:26:09 EEST" -> (known after apply)
      ~ live_date            = "Monday, 15-Jul-24 11:26:38 EEST" -> (known after apply)
      ~ locked               = false -> (known after apply)
      + port_interfaces      = (known after apply)
      ~ product_type         = "VXC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
      + secondary_name       = (known after apply)
      ~ service_id           = 0 -> (known after apply)
      ~ shutdown             = false -> (known after apply)
      ~ usage_algorithm      = "POST_PAID_HOURLY_SPEED_METRO_VXC" -> (known after apply)
      + virtual_router       = (known after apply)
      ~ vll                  = {
          ~ a_vlan          = 815 -> (known after apply)
          ~ b_vlan          = 815 -> (known after apply)
          ~ description     = "" -> (known after apply)
          ~ id              = 0 -> (known after apply)
          ~ name            = "" -> (known after apply)
          ~ rate_limit_mbps = 100 -> (known after apply)
          ~ resource_name   = "vll" -> (known after apply)
          ~ resource_type   = "vll" -> (known after apply)
        } -> (known after apply)
      ~ vxc_approval         = {
          ~ message   = "" -> (known after apply)
          ~ new_speed = 0 -> (known after apply)
          ~ status    = "" -> (known after apply)
          ~ type      = "" -> (known after apply)
          ~ uid       = "" -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # megaport_vxc.internet will be updated in-place
  ~ resource "megaport_vxc" "internet" {
      ~ a_end                = {
          ~ current_product_uid   = "b2e1d8d9-90d1-4c4e-b363-7d783718df6f" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ admin_locked         = false -> (known after apply)
      ~ attribute_tags       = {} -> (known after apply)
      ~ b_end                = {
          ~ current_product_uid   = "52cb6573-5cc8-45cc-8af1-d21db1fe3485" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "2f83dc65-5d4c-4730-a66d-926db48a0326" -> (known after apply)
          ~ product_name          = "Megaport Internet" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
          ~ vnic_index            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ cancelable           = true -> (known after apply)
      ~ company_name         = "1NCE GmbH" -> (known after apply)
      ~ contract_end_date    = "Monday, 14-Jul-25 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Monday, 15-Jul-24 11:26:38 EEST" -> (known after apply)
      ~ cost_centre          = "A-123-2024-GER-123-123" -> "A-123-2024-GER-123-124"
      ~ create_date          = "Monday, 15-Jul-24 11:25:31 EEST" -> (known after apply)
      ~ csp_connections      = [
          - {
              - connect_type         = "TRANSIT" -> null
              - customer_ip4_address = "162.43.161.1/31" -> null
              - customer_ip6_network = "2a0a:1800:1c::/64" -> null
              - ipv4_gateway_address = "162.43.161.0" -> null
              - ipv6_gateway_address = "2a0a:1800:1c::1" -> null
              - resource_name        = "b_csp_connection" -> null
              - resource_type        = "csp_connection" -> null
            },
        ] -> (known after apply)
      ~ distance_band        = "METRO" -> (known after apply)
      ~ last_updated         = "Monday, 15-Jul-24 11:26:06 EEST" -> (known after apply)
      ~ live_date            = "Monday, 15-Jul-24 11:26:38 EEST" -> (known after apply)
      ~ locked               = false -> (known after apply)
      + port_interfaces      = (known after apply)
      ~ product_type         = "VXC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
      + secondary_name       = (known after apply)
      ~ service_id           = 0 -> (known after apply)
      ~ shutdown             = false -> (known after apply)
      ~ usage_algorithm      = "POST_PAID_HOURLY_NORMALISED_SPEED" -> (known after apply)
      + virtual_router       = (known after apply)
      ~ vll                  = {
          ~ a_vlan          = 1305 -> (known after apply)
          ~ b_vlan          = 1305 -> (known after apply)
          ~ description     = "" -> (known after apply)
          ~ id              = 0 -> (known after apply)
          ~ name            = "" -> (known after apply)
          ~ rate_limit_mbps = 100 -> (known after apply)
          ~ resource_name   = "vll" -> (known after apply)
          ~ resource_type   = "vll" -> (known after apply)
        } -> (known after apply)
      ~ vxc_approval         = {
          ~ message   = "" -> (known after apply)
          ~ new_speed = 0 -> (known after apply)
          ~ status    = "" -> (known after apply)
          ~ type      = "" -> (known after apply)
          ~ uid       = "" -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # megaport_vxc.ipxgrx[0] will be updated in-place
  ~ resource "megaport_vxc" "ipxgrx" {
      ~ a_end                = {
          ~ current_product_uid   = "b2e1d8d9-90d1-4c4e-b363-7d783718df6f" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-MVE" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ admin_locked         = false -> (known after apply)
      ~ attribute_tags       = {} -> (known after apply)
      ~ b_end                = {
          ~ current_product_uid   = "92036c9c-cb08-485f-b3a9-d2dfa447700c" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Equinix PA2/3" -> (known after apply)
          ~ location_id           = 515 -> (known after apply)
          ~ ordered_vlan          = 0 -> (known after apply)
          ~ owner_uid             = "e5f088f0-15b6-44da-88a9-3ef8569b94ec" -> (known after apply)
          ~ product_name          = "TEST-EU-Paris-ICSS-Port" -> (known after apply)
          ~ secondary_name        = "" -> (known after apply)
          ~ vnic_index            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ cancelable           = true -> (known after apply)
      ~ company_name         = "1NCE GmbH" -> (known after apply)
      ~ contract_end_date    = "Wednesday, 14-Aug-24 17:00:00 EEST" -> (known after apply)
      ~ contract_start_date  = "Monday, 15-Jul-24 11:26:38 EEST" -> (known after apply)
      ~ cost_centre          = "A-123-2024-GER-123-123" -> "A-123-2024-GER-123-124"
      ~ create_date          = "Monday, 15-Jul-24 11:25:30 EEST" -> (known after apply)
      + csp_connections      = (known after apply)
      ~ distance_band        = "METRO" -> (known after apply)
      ~ last_updated         = "Monday, 15-Jul-24 11:26:04 EEST" -> (known after apply)
      ~ live_date            = "Monday, 15-Jul-24 11:26:38 EEST" -> (known after apply)
      ~ locked               = false -> (known after apply)
      + port_interfaces      = (known after apply)
      ~ product_type         = "VXC" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
      + secondary_name       = (known after apply)
      ~ service_id           = 0 -> (known after apply)
      ~ shutdown             = false -> (known after apply)
      ~ usage_algorithm      = "POST_PAID_HOURLY_SPEED_METRO_VXC" -> (known after apply)
      + virtual_router       = (known after apply)
      ~ vll                  = {
          ~ a_vlan          = 2674 -> (known after apply)
          ~ b_vlan          = 2674 -> (known after apply)
          ~ description     = "" -> (known after apply)
          ~ id              = 0 -> (known after apply)
          ~ name            = "" -> (known after apply)
          ~ rate_limit_mbps = 100 -> (known after apply)
          ~ resource_name   = "vll" -> (known after apply)
          ~ resource_type   = "vll" -> (known after apply)
        } -> (known after apply)
      ~ vxc_approval         = {
          ~ message   = "" -> (known after apply)
          ~ new_speed = 0 -> (known after apply)
          ~ status    = "" -> (known after apply)
          ~ type      = "" -> (known after apply)
          ~ uid       = "" -> (known after apply)
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```